simulacion/14.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-01 Fri 11:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Colas M/M/1 y M/M/1/K</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="/res/org.css"/>
<link rel="stylesheet" type="text/css" href="/home/mk/Documents/blogs/org.css"/>
</head>
<body>
<div id="content">

<div id="outline-container-org08eea26" class="outline-2">
<h2 id="org08eea26">Análisis teórico de una cola M/M/1</h2>
<div class="outline-text-2" id="text-org08eea26">
</div>
<div id="outline-container-orgf9ed997" class="outline-3">
<h3 id="orgf9ed997">Colas M/M/1</h3>
<div class="outline-text-3" id="text-orgf9ed997">
<p>
Consider a single-server system in which customers arrive according to a Poisson
process of rate lambda so the <b>interval times</b> are iid exponential random
variables with mean 1/lambda.  Assume that the service times are iid exponential
random variables with mean 1/mu, and that the interval and service times are
independent.
</p>

<p>
imagen
</p>

<p>
M/M/1
</p>


<p>
OBJETIVOS:
Derivar la distribución de probabilidad
en estado estacionario de
</p>
<ul class="org-ul">
<li>N(t): número de clientes en el sistema</li>
<li>T: tiempo total en el sistema</li>
</ul>

<p>
Formula de Little (Comportamiento promedio)
</p>

<p>
\[E[N] = \lambda E[T]\]
</p>
</div>
</div>
</div>

<div id="outline-container-orgc21e31c" class="outline-2">
<h2 id="orgc21e31c">Distribución de N(t) en una cola M/M/1</h2>
<div class="outline-text-2" id="text-orgc21e31c">
</div>
<div id="outline-container-org056f850" class="outline-3">
<h3 id="org056f850">Distribución de N(t)</h3>
<div class="outline-text-3" id="text-org056f850">
<p>
Supongamos que N(t) = k, y consideremos los posibles casos que hagan cambiar
el número de clientes:
</p>
<ol class="org-ol">
<li>llega un nuevo clilente (+1), o</li>
<li>se va un cliente (-1)</li>

<li>El tiempo hasta que llegue un nuevo cliente tiene una distribución
exponencial y es independiente de los tiempos de arribo presente y pasado
(memoryless property).</li>
<li>El tiempo de partida del próximo cliente también es exponencial e
independiente del tiempo que en el sistema (memoryless property).</li>
</ol>

<p>
En una cola M/M/1, N(t) es una cadena de Markov
</p>

<p>
Si sabemos que N(t) = k, la historia pasada es irrelevante para las
probabilidades de cambio en el número de clientes en el sistema.
</p>
</div>
</div>

<div id="outline-container-orgdf8225c" class="outline-3">
<h3 id="orgdf8225c">La cadena de Markov asociada a una cola M/M/1</h3>
<div class="outline-text-3" id="text-orgdf8225c">
<ol class="org-ol">
<li>Since A(t), el numero de arribos en un intervalo de largo t, es un proceso de
Poisson, la probabilidad de un arribo en un intervalo de largo &delta; es
\[P(A(\delta)=1) = \frac{\lambda \delta}{1!} e^{-\lambda \delta} = \lambda
      \delta \left{ 1 - \frac{\lambda \delta}{1!} + \frac{(\lambda \delta)^2}{2!} -
      \dots \right} = \lambda \delta + o(\delta^2)\]</li>
<li>Similarmente, la probabilidad de más de un arribo es \[P(A(\delta) \geq 2) =
      o(\delta^2)\]</li>
<li>Ya que el tiempo de servicio es una variable aleatoria exponencial &tau;, el
tiempo que pasa un cliente en servicio es independiente de cuánto tiempo
pasará en servicio debido a la propiedad de perdida de memoria de &tau;. En
particular, la probabilidad de que un cliente en servicio complete su
servicio en los siguientes &delta; segundos es \[P(\tau \leq \delta) = 1-
      e^{-\mu \delta}=\mu \delta + o(\delta^2)\]</li>
</ol>

<p>
2.png
</p>
</div>
</div>

<div id="outline-container-org31a1cf0" class="outline-3">
<h3 id="org31a1cf0">Estado estacionario de una cola M/M/1 (I)</h3>
<div class="outline-text-3" id="text-org31a1cf0">
<p>
Condición de <b>equilibrio</b> o <b>steady state</b> (si existe):
</p>

<p>
\[\pi = \pi P\]
</p>

<p>
\[\sum_{k=1}^K \pi_k = 1\]
</p>

<p>
\[\pi = (p_0 p_1 \dots p_{j-1} p_j p_{j+1} \dots)\]
</p>

<p>
3.png
</p>

<p>
En el estado estacionario:
&lambda; p_0 = &mu; p1
(&lambda; + &mu;) p_j = &lambda; p<sub>j-1</sub> + &mu; p<sub>j+1</sub>
</p>

<p>
4.png
</p>
</div>
</div>

<div id="outline-container-org1f6bf4d" class="outline-3">
<h3 id="org1f6bf4d">Estado estacionario de una cola M/M/1 (II)</h3>
<div class="outline-text-3" id="text-org1f6bf4d">
<p>
Resolvamos para el estado estacionario:
(&lambda; + &mu;) p_j = &lambda; p<sub>j-1</sub> + &mu; p<sub>j+1</sub>
&lambda; p_j - &mu; p<sub>j+1</sub> = &lambda; p<sub>j-1</sub> - &mu; p_j
</p>

<p>
Entonces:
&lambda; p<sub>j-1</sub> - &mu; p_j = constante
</p>

<p>
con j=1 &rarr; constante = &lambda; p_0 - &mu; p_1 = 0 &rarr; &lambda; o<sub>j-1</sub> = &mu; p_j
</p>

<p>
Definimos: &rho; = &lambda; / &mu;
</p>

<p>
Obtenemos p_0 utilizando la suma de probabilidades
</p>

<p>
$$1=&sum;_j=0^&infin; p_j = (1+ &rho; + &rho;^2 + &hellip;) p_0 = \frac{1}{1-p}p<sub>0</sub>
</p>

<p>
Donde la serie converge si y solo si &rho; &lt; 1;
</p>

<p>
Finalmente:
%$pz1
</p>

<p>
\[Finalemte p_j = (1-\rho ) \rho^j j=0..2\]
</p>

<p>
Nota: El estado estacionario existe únicamente cuando &lambda; &lt; &mu;
Pregunta: ¿Qué pasa si no se cumple esta condición?
</p>
</div>

<div id="outline-container-org9d8ddd6" class="outline-4">
<h4 id="org9d8ddd6"><span class="todo TODO">TODO</span> Analicemos la distribución del</h4>
<div class="outline-text-4" id="text-org9d8ddd6">
<p>
número de clientes en la cola:
012345
j
0
0.2
0.4
0.6
0.8
1
P[N(t) = j]
= 0.1
= 0.25
= 0.5
= 0.75
Fórmula de Little
Número promedio de clientes:
Tiempo promedio en sistema:
Tiempo de espera en cola:
Número de clientes en cola:
Fórmula de Little Utilización del servidor:
Estado estacionario de una cola M/M/1 (III)
Facultad de Ingeniería - Universidad de Buenos Aires Modelos y Simulación - 75.26/95.19 - Clase 11
Ejemplo clase pasada (I) 11
Facultad de Ingeniería - Universidad de Buenos Aires Modelos y Simulación - 75.26/95.19 - Clase 11
Ejemplo clase pasada (II) 12
El tiempo promedio en sistema es:
Si duplicamos la tasa de arribos y queremos mantener el tiempo promedio en
sistema, planteamos:
E[T] =
1
μ − λ
=
1
μ* − 2λ
Entonces: μ* = μ + λ &lt; μ + μ
λ &lt; μ
= 2μ
Es decir: μ* &lt; 2μ
Conclusión: en una cola tipo M/M/1, si se duplica la tasa de arribos, para
mantener el tiempo promedio en sistema constante es necesario incrementar
la tasa de servicio pero con un factor inferior al doble.
</p>

<p>
Ejemplo M/M/1: Congestión 13
Server utilization Mean number of packets Mean time in the system
</p>

<p>
Ejemplo M/M/1: Concentración y efecto escala 14
Distribución de T
en una cola M/M/1
</p>

<p>
Distribución de T 16
(igual a la distribución de
clientes en el sistema)
(Gamma distribution)
(exponential distribution)
</p>

<p>
Ejemplo M/M/1: Cálculo de percentil de delay 17
Colas con capacidad
finita: M/M/1/K
</p>

<p>
Cola M/M/1/K (I) 19
En estado estacionario:
</p>

<p>
Cola M/M/1/K (II) 20
Mean customer delay
Material de Lectura
</p>
<ul class="org-ul">
<li>Leer para la próxima clase:</li>
</ul>
<p>
Libros (Mínimo):
[15] Probability,_Statistics,_and_Random_Processes_for_Eletrical_Engineerging, 3rd Ed Leon-Garcia,
Cap. 12.
Libros (opcional):
[16] Performance-Modeling-and-Design-of-Computer-Systems-Queueing-Theory-in-Action, Caps. 1-2.
[17] Probability Statistics and Queueing Theory With Computer Science Applications-Arnold_O_Allen,
Cap. 5.
</p>
<ul class="org-ul">
<li>Material de lectura (esta clase):</li>
</ul>
<p>
Libros (Mínimo):
[15] Probability,_Statistics,_and_Random_Processes_for_Eletrical_Engineerging,
3rd Ed Leon-Garcia, Cap. 12.
Libros (opcional):
[16] Performance-Modeling-and-Design-of-Computer-Systems-QueueingTheory-in-Action, Caps. 1-2.
[17] Probability Statistics and Queueing Theory With Computer Science
Applications-Arnold_O_Allen, Cap. 5.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
Last update: 2020-05-01 11:27
</div>
</body>
</html>
